app/controllers/documents_controller.rb

SELECT * FROM "documents"
---
  def index
    @documents = Document.all

SELECT * FROM "documents" WHERE ("documents"."id" = 0)
---
  def show
    @document = Document.find(params[:id])

INSERT INTO "documents" ("updated_at", "title", "user_id", "contents", "created_at") VALUES('2010-03-29 06:07:20', NULL, NULL, NULL, '2010-03-29 06:07:20')
---
  def new
    @document = Document.new

    respond_to do |format|
      format.js {
        @document.user_id = params[:user_id] if params[:user_id]
        @document.title = params[:title] if params[:title]
        if @document.save

SELECT * FROM "documents" WHERE ("documents"."id" = 1)
---
  def edit
    @document = Document.find(params[:id])

INSERT INTO "documents" ("updated_at", "title", "user_id", "contents", "created_at") VALUES('2010-03-26 05:18:59', 'My First Documents', 1, '"say what you want to say, okay?', '2010-03-26 05:18:59')
---
  def create
    @document = Document.new(params[:document])

    respond_to do |format|
      if @document.save

SELECT * FROM "documents" WHERE ("documents"."id" = '14') LIMIT 1
UPDATE "documents" SET "updated_at" = '2010-03-27 20:30:14', "contents" = 'That man should labour and sorrow and learn and forget, and return to the dark valley whence he came and begin his labours anew' WHERE "id" = 1
---
  def save
    @document = Document.find(params[:id])
    respond_to do |format|
      if @document.update_attributes(params[:document])

SELECT * FROM "documents" WHERE ("documents"."id" = 1)
UPDATE "documents" SET "title" = 'Document 2', "updated_at" = '2010-03-29 06:11:58', "contents" = 'Document 2' WHERE "id" = 2
---
  def update
    @document = Document.find(params[:id])

    respond_to do |format|
      if @document.update_attributes(params[:document])