app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id]) if params[:id]
---
SELECT * FROM "users" WHERE ("users"."id" = 1)

  def documents
    @user = User.find_by_key(params[:key]) if params[:key]

	if @user.nil? and params[:key]
		@user = User.new(:key => params[:key])
    	if @user.save
			render :js => "(function(){T8Writer.Modes.help();})();"
		else
			render :js => "throw new Error('unable to create new user');"
		end
	else
		@documents = @user.documents
		respond_to do |format|
			if (@documents.count > 0)
---
SELECT * FROM "users" WHERE ("users"."key" = '6e062041a574a50256305cfb43b6b8f3') LIMIT 1
INSERT INTO "users" ("updated_at", "key", "password", "created_at") VALUES('2010-05-14 05:40:48', '97d5b3ae5a45b78628d50c58e780942d', NULL, '2010-05-14 05:40:48')
SELECT * FROM "documents" WHERE ("documents".user_id = 8) ORDER BY updated_at DESC
SELECT count(*) AS count_all FROM "documents" WHERE ("documents".user_id = 1)

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("updated_at", "key", "password", "created_at") VALUES('2010-03-26 05:38:39', '6e062041a574a50256305cfb43b6b8f3', 'bubbac', '2010-03-26 05:38:39')